<a href="https://colab.research.google.com/github/neilkazimierzsheridan/data_science_course/blob/main/ds_Pandas_8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

***Pandas***

In [1]:
import numpy as np
import pandas as pd

# Pandas: Input and Output

In [ ]:
# IN pandas.read_csv , OUT dataframe.to_csv

In [ ]:
pwd

'/content'

In [ ]:
ls

sample_data/

In [ ]:
cd sample_data/

/content/sample_data

In [ ]:
ls

anscombe.json*                mnist_test.csv
california_housing_test.csv   mnist_train_small.csv
california_housing_train.csv  README.md*

In [ ]:
df = pd.read_csv('california_housing_test.csv')
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [ ]:
df.to_csv('test.csv')

In [ ]:
ls

anscombe.json*                mnist_test.csv         test.csv
california_housing_test.csv   mnist_train_small.csv
california_housing_train.csv  README.md*

In [18]:
url = "https://en.wikipedia.org/wiki/World_population"

In [19]:
tables = pd.read_html(url) # get all the tables from that url

In [20]:
len(tables) #how many tables in the wiki article?

27

In [21]:
tables[0]

        World population (millions, UN estimates)[15]  ...
                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [ ]:
tables[1]

                  Continent  ...             Most populous city (metropolitan area)
0                      Asia  ...  37,393,000/13,929,000 – Greater Tokyo Area/Tok...
1                    Africa  ...                             20,900,000 – Cairo[18]
2                    Europe  ...  16,855,000/12,537,000 – Moscow metropolitan ar...
3             Latin America  ...  22,043,000/12,176,000 – São Paulo Metro Area/S...
4  Northern America[note 2]  ...  23,724,000/8,323,000 – New York metropolitan a...
5                   Oceania  ...                                 4,925,000 – Sydney
6                Antarctica  ...                            1,258 – McMurdo Station

[7 rows x 5 columns]

In [22]:
tables[0].columns #see the header got that upper index

MultiIndex([('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...)],
           )

In [23]:
#cleaning up table[0]
world_topten = tables[0]

In [24]:
world_topten = world_topten["World population (millions, UN estimates)[15]"]
#note you can't run the above more than once since you got rid of that index
world_topten

                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [25]:
world_topten = world_topten.drop(11) #drop the notes row

In [26]:
world_topten

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [27]:
world_topten = world_topten.drop('#', axis=1) #rid of # rating since it is same as index column

In [28]:
world_topten

   Top ten most populous countries  2000  2015 2030[A]
0                         China[B]  1270  1376    1416
1                            India  1053  1311    1528
2                    United States   283   322     356
3                        Indonesia   212   258     295
4                         Pakistan   136   208     245
5                           Brazil   176   206     228
6                          Nigeria   123   182     263
7                       Bangladesh   131   161     186
8                           Russia   146   146     149
9                           Mexico   103   127     148
10                     World total  6127  7349    8501

In [29]:
#changing names of columns
world_topten.columns = ['Country', '2000', '2015', '2030 Estimated']

In [30]:
world_topten

          Country  2000  2015 2030 Estimated
0        China[B]  1270  1376           1416
1           India  1053  1311           1528
2   United States   283   322            356
3       Indonesia   212   258            295
4        Pakistan   136   208            245
5          Brazil   176   206            228
6         Nigeria   123   182            263
7      Bangladesh   131   161            186
8          Russia   146   146            149
9          Mexico   103   127            148
10    World total  6127  7349           8501

In [ ]:
world_topten = world_topten.drop(10) #drop the total row

In [ ]:
world_topten

         Country  2000  2015 2030 Estimated
0       China[B]  1270  1376           1416
1          India  1053  1311           1528
2  United States   283   322            356
3      Indonesia   212   258            295
4       Pakistan   136   208            245
5         Brazil   176   206            228
6        Nigeria   123   182            263
7     Bangladesh   131   161            186
8         Russia   146   146            149
9         Mexico   103   127            148

In [ ]:
#output it to html
world_topten.to_html('worldtopten.html')

In [ ]:
ls

anscombe.json*                mnist_test.csv         sample_table.html
california_housing_test.csv   mnist_train_small.csv  test.csv
california_housing_train.csv  README.md*             worldtopten.html

# Excel Files Read/Write

In [4]:
from google.colab import files
uploaded = files.upload()

Saving my_excel_file.xlsx to my_excel_file.xlsx

In [8]:
import io
df = pd.read_excel(io.BytesIO(uploaded['my_excel_file.xlsx']), sheet_name='First_Sheet') #remember can read in lots of other types too!

In [2]:
import openpyxl

In [3]:
import xlrd

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
wb = pd.ExcelFile(io.BytesIO(uploaded['my_excel_file.xlsx']))

With multiple sheets to deal with

In [11]:
wb.sheet_names #what are the sheet names

['First_Sheet']

In [13]:
excel_sheet_dict = pd.read_excel(io.BytesIO(uploaded['my_excel_file.xlsx']), sheet_name=None)

In [14]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [ ]:
#writing to excel file like this
df.to_excel('example.xlsx',sheet_name='First Sheet')

# SQL Databases

In [15]:
import sqlalchemy

In [16]:
from sqlalchemy import create_engine

In [17]:
#using sqlite here, with a RAM database
temp_db = create_engine('sqlite:///:memory:')

In [33]:
pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a', 'b', 'c', 'd'])

    a   b   c   d
0  90  80  53  41
1  57   9   1  52
2  77  80  31  98
3  63  13  17  97

In [34]:
df.to_sql(name='new_table', con=temp_db) #send the dataframe as a table to temp_db

In [35]:
#read entire table from the database. Note it has a new index now
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [36]:
new_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [37]:
#passing actual SQL queries via pandas! Select columns A and C
results = pd.read_sql_query(sql="SELECT a, c FROM new_table", con=temp_db)

In [38]:
results

    a   c
0   0   2
1   4   6
2   8  10
3  12  14